Управление_торговлей.ПБТ/src/Documents/ФормированиеЭталонаПоОрганолептике/ФормированиеЭталонаПоОрганолептике.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеЭталонаПоОрганолептике</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <basedOn>Document.ФормированиеЭталонаПоОрганолептике</basedOn>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПротоколАнализа</types>
      <types>DocumentRef.ФормированиеЭталонаПоОрганолептике</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринялРешение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Управление_торговлей.ПБТ/src/InformationRegisters/ЭталоныПоОрганолептике/ЭталоныПоОрганолептике.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭталоныПоОрганолептике</name>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КтоУтвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеВыводитьВОтчеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КтоИзменилСтатус</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/Documents/ФормированиеЭталонаПоОрганолептике/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем ТЗНесоответствий;
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		ДокументПоступления = ДанныеЗаполнения.ДокументПоступления;
		КодПродукта = ДанныеЗаполнения.КодПродукта;
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		ДатаВведения = ДанныеЗаполнения.Дата;
		
		//0018202
		СрокДействияЭталона = Номенклатура.СрокГодности;
		ДатаОкончанияДействия = ДобавитьМесяц(ДанныеЗаполнения.Дата, СрокДействияЭталона);
		
		Партия = ДанныеЗаполнения.Партия;
		НомерЗамеса = ДанныеЗаполнения.НомерЗамеса;
		Организация = ДанныеЗаполнения.Организация;
		
		Если Лаборатория_Сервер.гл_ОбразецСоответствуетНормативам(ДанныеЗаполнения, , ДанныеЗаполнения.ТЧ_Показатели.Выгрузить(), ТЗНесоответствий) Тогда
		Иначе
			Сообщить("Протокол не соответсвует нормативам!");
			СтандартнаяОбработка = ЛОжь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ПринялРешение) Тогда
		ПринялРешение = ПараметрыСеанса.ТекущийПользователь;
		Записать();
	КонецЕсли; 
	
	НабЗап = РегистрыСведений.ЭталоныПоОрганолептике.СоздатьНаборЗаписей();
	НабЗап.Отбор.Номенклатура.Установить(Номенклатура);
	НабЗап.Отбор.ДатаВведения.Установить(ДатаВведения);
	//НабЗап.Отбор.Регистратор.Установить(Ссылка);
	НовЗап = НабЗап.Добавить();
	НовЗап.Активность = Истина;
	НовЗап.Номенклатура = Номенклатура;
	НовЗап.ДатаВведения = ДатаВведения;
	НовЗап.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовЗап.Комментарий = Комментарий;
	НовЗап.КтоУтвердил = ПринялРешение;
	НовЗап.НомерЗамеса = НомерЗамеса;
	НовЗап.Серия = Серия;
	НовЗап.Регистратор = Ссылка;
	НовЗап.Период = ДатаВведения;
	НовЗап.Статус = Статус;	
	НабЗап.Записать();
	
КонецПроцедуры
